app/Controllers/Penyiraman.php

INSERT INTO `penyiraman` (`penyiraman`, `created_date`) VALUES ('3', '2023-05-07 09:48:10')
---
    public function create() {
        $penyiraman = new ModelPenyiraman();
        $key = $this->request->getVar("key");
        // $key = 'keyloveK7';

        if (!($key === "keyloveK7")) {
            $response = [
                'code'    => 403,
                'status'   => 'error',
                'messages' => "Key is Not Valid"
            ];
            return $this->respondCreated($response);
        }
        $data = [
            'penyiraman' => $this->request->getVar('penyiraman'),

            'created_date'  => date('Y-m-d H:i:s'),

        ];

        $penyiraman->insert($data);